"欢迎体验声网服务"="Welcome to the Sound Network service";
"声网"="Agora";
"请输入验证码"="Please enter the verification code";
"请您认真阅读用户协议及隐私政策的条款内容，同意后可开始使用我们的服务"="Please read the terms of the user agreement and privacy policy carefully, and after agreeing to it, you can start using our services";
"请输入手机号"="Please enter your phone number";
"手机号码格式错误"="Wrong phone number format";
"我已阅读并同意 用户协议 及 隐私政策 " = "I have read and agree to the User Agreement and Privacy Policy";
"用户协议"="User Agreement";
"隐私政策"="Privacy policy";
"声动互娱软件是一款用于向声网客户展示产品使用效果的测试产品，仅用于测试产品的功能、性能和可用性，而非提供给大众使用的正式产品。\n1.我们将依据《用户协议》及《隐私政策》来帮助您了解我们在收集、使用、存储您个人信息的情况以及您享有的相关权利。\n2.在您使用本测试软件时，我们将收集您的设备信息、日志信息等，同时根据不同使用场景，你可以授予我们获取您设备的麦克风权限、摄像头权限等信息。\n\n您可通过阅读完整的《用户协议》及《隐私政策》来了解详细信息。"="Acoustic interactive entertainment software is a test product used to show Sound Network customers the effects of product usage. It is only used to test the functionality, performance, and usability of the product, not an official product for public use. \n1. We will help you understand how we collect, use and store your personal information and your rights in relation to it in accordance with the User Agreement and the Privacy Policy. \n2. When you use this test software, we will collect your device information, log information, etc. At the same time, according to different usage scenarios, you can grant us to obtain information such as microphone permission and camera permission of your device. \n\nYou can find out more by reading the full User Agreement and Privacy Policy.";
"不同意"="Disapproved";
"同意"="Consents";
"发送验证码"="Send verification code";
"%@秒后可重新发送"="%@Can be re-sent in seconds";
"验证码"="Verification code";
"请输入验验证码"="Please enter the verification code";
"完成验证"="Complete verification";
"拖动下方滑块完成拼图"="Drag the slider below to complete the puzzle";
"主唱"="Lead singer";
"已点"="Already ordered";
"点歌"="Order a song";
"演唱中"="Singing";
"合唱"="Chorus";
"独唱"="独唱";
"点唱: %@"="Vote:%@";
"控制台"="Consoles";
"耳返"="Earwback";
"请插入耳机使用耳返功能"="Please plug in the headphones to use the ear-return function";
"MV"="Lyric background";
"升降调"="Lift adjustment";
"音量"="Volumes";
"伴奏"="Accompaniment";
"原唱"="Original singer";
"KTV"="KTV";
"演唱会"="Concert";
"录音棚"="Recording studio";
"留声机"="Phonograph";
"空旷"="Empty";
"空灵"="Ethereal";
"流行"="Prevalent";
"R&B"="R&B";
"点歌"="Order a song";
"已点"="Already ordered";
"歌曲来自咪咕音乐"="The song comes from Migu Music";
"搜索歌曲,歌手"="Search songs, singers";
"取消"="Rescinded";
"嗨唱推荐"="Hi Sing Recommended";
"抖音热歌"="Popular songs on TikTok";
"New Songs List"="Hot new songs";
"KTV必唱"="A must-sing song for KTV";
"未找到相关结果"="No related results found";
"本机网络好"="The network of this machine is good";
"本机网络良"="The network of the machine is good";
"本机网络差"="Poor local network";
"当前在线人数：%@"="Number of people currently online:%@";
"当前在线人数：1"="Number of people currently online: 1";
"0"="0";
"分"="Dividing";
"%d号麦"="%dNo wheat";
"房主"="Homeowners";
"更多操作"="More actions";
"美声"="Bel canto";
"音效"="Sound effects";
"下麦"="Shimomugi";
"点击空麦位，上麦后可点歌和发言"="Click on the empty mic, on the mic can be song and speech";
"音频上麦"="Audio on microphone";
"视频上麦"="Video on microphone";
"大房间(男)"="Big room (male)";
"小房间(男)"="Small room (male)";
"大房间(女)"="Large room (female)";
"小房间(女)"="Small room (female)";
"启用电音"="Enable electronic audio";
"选择调式"="Choice of mode";
"和风"="Zephyr";
"小调"="Minor notes";
"大调"="Major";
"当前无人演唱\n\n点击“点歌”一展歌喉"="Currently no one is singing, \n\nclick “Order a Song” to show off the song";
"本机网络差，无法加入合唱"="The machine's network is poor, so I can't join the chorus";
"我知道了"="IC";
"抢麦倒计时"="The countdown to grabbing wheat";
"加入合唱"="Join the chorus";
"不等了，独唱"="No more waiting, sing solo";
"99"="99";
"你的总分"="Your total score";
"好的"="Goodly";
"欢迎来到声网在线K歌房，\n 美声音效、歌词同步、打分等九大场景轻松还原\n线下K歌体验，超高音质，以歌会友，一起\n来体验吧！"="Welcome to Sound Network's online K-pop studio.\n Nine major scenes, including beautiful sound effects, lyric syncing, and scoring, can easily recreate the \noffline K-song experience. The sound quality is super high. Meet friends with songs and \nexperience it together!";
"敬请期待"="Stay tuned";
"创建房间"="Create a room";
"加入"="Joins";
"%@人"="%@Persons";
"随机"="Random";
"房间是否加密"="Is the room encrypted";
"公开"="Public";
"加密"="Encryption";
"请设置4位数房间密码"="Please set a 4-digit room password";
"创建"="Founding";
"本应用为测试产品，请勿商用"="This app is a test product, please do not use it commercially";
"单次K歌最长20分钟，每个房间最多8人"="The maximum length of a single K-song is 20 minutes, with a maximum of 8 people per room";
"请输入标题"="Please enter a title";
"和你一起看月亮"="Watch the moon with you";
"治愈"="Heals";
"一锤定音"="The final word";
"有酒吗"="Is there alcohol";
"早安序曲"="Good Morning Overture";
"风情万种的歌房"="A karaoke room with all kinds of styles";
"近在远方"="near and far";
"风中诗"="Poems in the Wind";
"那年风月"="That year's Fengyue";
"三万余年"="More than 30,000 years";
"七十二街"="72nd Street";
"情怀如诗"="Feelings like poetry";
"简遇而安"="keep it simple but at ease";
"十里笙歌"="Ten Mile Sho Song";
"回风舞雪"="return to the wind and dance to the snow";
"梦初醒处"="The first place to wake up in a dream";
"别来无恙"="How are you";
"三里清风"="Three Mile Breeze";
"烟雨万重"="Heavy smoke and rain";
"水洗晴空"="Clear skies washed by water";
"轻风淡月"="Light breeze and light moon";
"加入频道失败"="Failed to join channel";
"加入频道失败:%ld"="Failed to join channel: %ld";
"退出房间"="Exit the room";
"确定解散该房间吗？"="Are you sure you want to disband this room?";
"确定退出该房间吗？"="Are you sure you want to leave this room?";
"确定"="positively";
"修改背景失败"="Background modification failed";
"房主已解散房间,请确认离开房间"="The owner has dismissed the room, please make sure to leave the room";
"在线K歌房"="Online K-karaoke";
"输入密码"="Enter password";
"请输入房间密码"="Please enter the room password";
"加入房间失败"="Failed to join room";
"创建房间失败"="Room creation failed";
"用户名"="username";
"关于我们"="About Us";
"退出登录"="sign out";
"注销账号"="Cancelling an account";
"修改昵称"="Change nickname";
"请输入昵称"="Please enter a nickname";
"上传头像"="Upload an avatar";
"拍照上传"="Take a picture and upload";
"本地相册上传"="Local album upload";
"相册不可用"="Album not available";
"修改成功"="Modified successfully";
"确定注销账号？"="Are you sure you want to cancel your account?";
"注销账号后，您将暂时无法使用该账号体验我们的服务，真的要注销吗？"="After you cancel the account, you will not be able to use the account to experience our services for the time being. Do you really want to cancel it?";
"注销"="deregister";
"确定退出登录?"="Are you sure to log out?";
"退出登陆后，我们还会继续保留您的账户数据，记得再来体验哦～"="After you log out and log in, we will continue to retain your account data, remember to experience it again~";
"退出"="quit";
"当前版本号 LTS%@(%@) SDK %@"="Current version number LTS %@(%@) SDK%@";
"首页"="Home page";
"发现"="uncovers";
"我的"="my";
"点击重试"="click retry";
"返回"="return";
"加载歌曲失败"="Failed to load songs";
"验证码校验失败，请重试"="Verification code verification failed, please try again";
"点歌失败，请重试"="Song request failed, please try again";
"伴奏"="Accompaniment";
"切换下一首歌曲？"="Switch to the next song?";
"切换歌曲"="Switch songs";
"确定退出房间？"="Are you sure to leave the room?";
"个人信息保护指引"="Personal Information Protection Guidelines";
"不同意并退出"="disagree and exit";
"同意并继续"="Agree and continue";
"同意 用户协议 及 隐私政策 后，声动互娱才能为您提供协作服务。"="After agreeing to the User Agreement and Privacy Policy, Sound Dynamic Interactive Entertainment can provide you with collaborative services.";
"未找到相关结果"="No related results found";
"请先上坐"="Please take a seat first";
"Token已失效，请重新登录"="Token has expired, please log in again";
"您的行为存在涉嫌违法违规内容，请规范行为。"="Your actions are suspected of being illegal and illegal. Please regulate your behavior.";
"声动互娱”想访问您的相册"="Sound Entertainment” I want to access your album";
"声网需要您开启相册访问功能，读取照片上传头像"="Sound Network requires you to enable the album access function to read photos and upload avatars";
"不允许"="disallowed";
"好"="well";
"解散房间"="Disband the room";
"房间标题"="Room Title";
"手机号"="Mobile Number";
"登录"="Login";
"ChatRoom"="Chat Room";
